app/controllers/api/v1/tickets_controller.rb

      def index
        @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

      def create
        data = JSON.parse(request.body.read)

        ticket_data = data
        excavator_data = data.dig('Excavator')


        ticket = Ticket.new(
          request_number: ticket_data.dig('RequestNumber'),
          sequence_number: ticket_data.dig('SequenceNumber'),
          request_type: ticket_data.dig('RequestType'),
          request_action: ticket_data.dig('RequestAction'),
          response_due_datetime: ticket_data.dig('DateTimes', 'ResponseDueDateTime'),
          primary_service_area_code: ticket_data.dig('ServiceArea', 'PrimaryServiceAreaCode', 'SACode'),
          additional_service_area_codes: ticket_data.dig('ServiceArea', 'AdditionalServiceAreaCodes', 'SACode'),
          digsite_well_known_text: ticket_data.dig('ExcavationInfo', 'DigsiteInfo', 'WellKnownText')
        )

        excavator = ticket.build_excavator(
          company_name: excavator_data.dig('CompanyName'),
          address: excavator_data.dig('Address'),
          crew_on_site: excavator_data.dig('CrewOnsite')
        )

        if ticket.save
---
INSERT INTO "excavators" ("ticket_id", "company_name", "address", "crew_on_site", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "tickets" ("request_number", "sequence_number", "request_type", "request_action", "response_due_datetime", "primary_service_area_code", "additional_service_area_codes", "digsite_well_known_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      def show
        @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]